
<html>
<head>
<title>Détails des résultats</title>
<LINK rel="stylesheet" type="text/css" href="templates/wwhelp.css">
</head>
<body>
<h2>Détails des résultats</h2>
<p>


    <p>Les r&eacute;sultats peuvent &ecirc;tre synth&eacute;tis&eacute;s ou d&eacute;taill&eacute;s. Le niveau de d&eacute;tails des r&eacute;sultats est repris dans "output" de "options" de l'onglet "Project" de la barre de Menu. Le tableau suivant appara&icirc;t :
    <br>
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig79.png"></p>

    <ul class="noindent">
      <li>Par d&eacute;faut le niveau de d&eacute;tails est&nbsp;de 2. Pour choisir un autre niveau de d&eacute;tails, faire glisser le curseur.</li>
    </ul>

    <p>Niveau1 : Seuls les d&eacute;placements de la derni&egrave;re it&eacute;ration&nbsp;sont&nbsp;calcul&eacute;s.</p>

    <p>Niveau 2 : Les d&eacute;placements, les rotations et les contraintes &agrave; mi-&eacute;paisseur de la plaque &agrave; la derni&egrave;re it&eacute;ration sont calcul&eacute;s.</p>

    <p>Niveau 3 :Les d&eacute;placements, les rotations et les contraintes &agrave; mi-&eacute;paisseur de la plaque sont calcul&eacute;s ainsi que les contraintes sur les faces sup&eacute;rieure et inf&eacute;rieure de la plaque. Ceci &agrave;&nbsp;la derni&egrave;re it&eacute;ration.</p>

    <p>Niveau 4 : Les d&eacute;placements, les rotations et les contraintes &agrave; mi-&eacute;paisseur de la plaque sont calcul&eacute;s ainsi que les contraintes sur les faces sup&eacute;rieure et inf&eacute;rieure de la plaque, les forces unitaires et les moments. Ceci &agrave;&nbsp;la derni&egrave;re it&eacute;ration.</p>

    <p>Niveau 5 :Les d&eacute;placements, les rotations et les contraintes &agrave; mi-&eacute;paisseur de la plaque sont calcul&eacute;s ainsi que les contraintes sur les faces sup&eacute;rieure et inf&eacute;rieure de la plaque, les forces unitaires et les moments. Et ceci &agrave; chaque it&eacute;ration.</p>

    <p>&nbsp;Les contraintes dans les cadres peuvent ne pas &ecirc;tre imprim&eacute;es dans le fichier r&eacute;sultat. D&eacute;cocher alors "Stresses in frames" .</p>

    <p>Les contraintes dans les raidisseurs peuvent ne pas &ecirc;tre imprim&eacute;es dans le fichier r&eacute;sultat. D&eacute;cocher alors "Stresses in the longitudinals" .</p>

    <p>Des r&eacute;sultats additionnels peuvent &ecirc;tre imprim&eacute;s. Ces r&eacute;sultats interm&eacute;diaires permettent de contr&ocirc;ler le processus num&eacute;rique et sont principalement utilis&eacute;s en mode "debug". Pour obtenir ces r&eacute;sultats compl&eacute;mentaires, cocher "Additional debugging parameters" (peu recommand&eacute;).</p>

    <p>Cliquer sur "OK" pour enregistrer les modifications.</p>


<p>
</body>
</html>