
<html>
<head>
<title>Séries de Fourier</title>
<LINK rel="stylesheet" type="text/css" href="templates/wwhelp.css">
</head>
<body>
<h2>Séries de Fourier</h2>
<p>


    <p>Le nombre maximum de termes de la s&eacute;rie de Fourier &agrave; prendre en compte peut-&ecirc;tre choisi. Cliquer sur l'onglet "Project" de la barre de Menu, choisir "Options" puis cliquer sur Fourier Series. Le tableau suivant appara&icirc;t :
    <br>
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig76.png"></p>

    <p>Le nombre maximum de termes de la s&eacute;rie de Fourier varie de&nbsp;-100 &agrave; 100.</p>

    <p>&nbsp;Nombre positif : Tous les termes de la s&eacute;rie de Fourier jusqu'au nombre maximum d&eacute;fini seront utilis&eacute;s. Il y a autant de termes que ce nombre.</p>

    <p>Nombre n&eacute;gatif : Seuls les termes impairs de la s&eacute;rie de Fourier jusqu'au nombre maximum d&eacute;fini seront utilis&eacute;s. Les termes pairs ne sont pas consid&eacute;r&eacute;s. Donc si on choisi un nombre maximum de termes de la s&eacute;rie de Fourier &eacute;gal &agrave; -5. Seuls les termes 1,3 et 5 seront pris en compte. Soient 3 termes au lieu de 5. Cette option est int&eacute;ressante quand la structure est sym&eacute;trique et est charg&eacute;e sym&eacute;triquement.</p>

    <p>Quel nombre? Selon l'usage de l'analyse, le nombre maximum de termes de la s&eacute;rie de Fourier &nbsp;est faible ou important :</p>

    <p>1&deg; Pour un contr&ocirc;le de donn&eacute;es, sans optimisation, on fait tourner le logiciel avec peu de termes de Fourier (de 1 &agrave; 3 ).&nbsp;</p>

    <p>2&deg; Pour une analyse finale sans optimisation, on choisit&nbsp;7 &agrave; 13 termes de Fourier.</p>

    <p>3&deg; Pour une analyse avanc&eacute;e, sans optimisation, mais avec des charges locales par exemple, on choisit un nombre de termes de Fourier sup&eacute;rieur &agrave; 25.&nbsp;</p>

    <p>4&deg; Pour un contr&ocirc;le de donn&eacute;es rapide, avec optimisation, on choisit 1 terme de Fourier.</p>

    <p>5&deg; Pour une analyse finale avec optimisation, on choisi 7 termes de Fourier.</p>

    <p>Cliquer sur OK pour enregistrer les informations.</p>


<p>
</body>
</html>