
<html>
<head>
<title>Propriétés du graphe</title>
<LINK rel="stylesheet" type="text/css" href="templates/wwhelp.css">
</head>
<body>
<h2>Propriétés du graphe</h2>
<p>


    En tapant F4 dans la fen&ecirc;tre principale ou en allant dans "View" puis "Display options", la fen&ecirc;tre suivante appara&icirc;t :

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig2.png"></p>

    <p>Elle repr&eacute;sente les options graphiques disponibles. Pour chaque onglet, de nouvelles options sont &agrave; d&eacute;terminer.</p>

    <ul class="noindent">
      <li>Screen : La couleur de fond de la fen&ecirc;tre est d&eacute;nom&eacute;e. Le choix d'une autre couleur peut-&ecirc;tre effectu&eacute; par un double click sur la case, un d&eacute;grad&eacute; appara&icirc;t alors.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig3.png"></p>

    <ul class="noindent">
      <li>Nodes : Sur le dessin les noeuds peuvent &ecirc;tre d&eacute;finis de plusieurs fa&ccedil;ons.&nbsp;En s&eacute;lectionnant&nbsp;"Node Caption", les noeuds peuvent &ecirc;tre nomm&eacute;s par leurs coordonn&eacute;es, par un num&eacute;ro ou peuvent ne pas &ecirc;tre nomm&eacute;s. En s&eacute;lectionnant "Node Color", la couleur du noeuds peut &ecirc;tre choisie. En cochant "on" dans la case "Node Visibility", les noeuds appara&icirc;tront, ils ne seront pas dessin&eacute;s si "off" est choisi. Par d&eacute;faut, les noeuds sont&nbsp;affich&eacute;s en blanc et num&eacute;rot&eacute;s.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig4.png"></p>

    <ul class="noindent">
      <li>Plates : Les &eacute;l&eacute;ments "plaque" sont affich&eacute;s &agrave; l'aide d'une&nbsp;&eacute;tiquette reprenant soit l'&eacute;paisseur rajout&eacute;e pour &eacute;viter la&nbsp;corrosion (en mm) , soit l'&eacute;paisseur&nbsp;brute (en mm), soit la longueur de l'&eacute;l&eacute;ment (en m), soit l'&eacute;paisseur nette (en mm), soit le num&eacute;ro du panneau, soit il n'y a pas d'&eacute;tiquette. La couleur de la plaque peut &ecirc;tre choisie, ainsi que son &eacute;chelle. Les plaques n'appara&icirc;tront pas si la visibilit&eacute; est sur "off". Par d&eacute;faut, les plaques sont affich&eacute;es en blanc sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig5.png"></p>

    <ul class="noindent">
      <li>Beams : Les &eacute;l&eacute;ments "poutre" sont&nbsp;affich&eacute;s&nbsp;de la m&ecirc;me fa&ccedil;on que les &eacute;l&eacute;ments "plaque". Par d&eacute;faut, les poutres sont affich&eacute;es en bleu sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig6.png"></p>

    <ul class="noindent">
      <li>Primary Frames : Les cadres principaux sont affich&eacute;s &agrave; l'aide d'une &eacute;tiquette&nbsp;reprenant soit l'&eacute;paisseur brute de la semelle, soit l'&eacute;paisseur de la semelle, soit la largeur de la semelle, soit la distance&nbsp;entre les cadres, soit l'&eacute;paisseur brute de l'&acirc;me, soit la hauteur de l'&acirc;me, soit l'&eacute;paisseur de l'&acirc;me, ou sans &eacute;tiquette. Par d&eacute;faut, les cadres sont affich&eacute;s en jaune sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig7.png"></p>

    <ul class="noindent">
      <li>Primary Stiffeners : Les raidisseurs principaux sont affich&eacute;s comme les cadres principaux. Par d&eacute;faut, les raidisseurs sont affich&eacute;s en noir sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig8.png"></p>

    <ul class="noindent">
      <li>Secondary Frames : Les cadres&nbsp;secondaires sont affich&eacute;s &agrave; l'aide d'une &eacute;tiquette reprenant soit l'&eacute;paisseur de la semelle, soit la largeur de la semelle, soit l'espacement entre les cadres,&nbsp;soit la hauteur de l'&acirc;me, soit l'epaisseur de l'&acirc;me, ou sans &eacute;tiquette. Par d&eacute;faut, les cadres secondaires sont affich&eacute;s en jaune p&acirc;le sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig9.png"></p>

    <ul class="noindent">
      <li>Secondary Stiffeners : Les raidisseurs secondaires sont affich&eacute;s comme les cadres secondaires. Par d&eacute;faut, les raidisseurs secondaires sont affich&eacute;s en noir sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig10.png"></p>

    <ul class="noindent">
      <li>Girders : Les traverses sont affich&eacute;es &agrave; l'aide d'une &eacute;tiquette&nbsp;reprenant soit la distance au noeud de d&eacute;part du panneau, soit l'&eacute;paisseur de la semelle, soit la largeur de la semelle, soit l'&eacute;paisseur de l'&acirc;me, soit la hauteur de l'&acirc;me, ou soit sans &eacute;tiquette. Par d&eacute;faut , les traverses sont affich&eacute;es en rose sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig11.png"></p>

    <p>&nbsp;</p>

    <ul class="noindent">
      <li>Lateral Uniform Pressures :Les pressions lat&eacute;rales uniformes sont repr&eacute;sent&eacute;es soit par une &eacute;tiquette&nbsp;reprenant les valeurs des pressions, soit sans &eacute;tiquette. Par d&eacute;faut, elles sont dessin&eacute;es en rouge sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig12.png"></p>

    <ul class="noindent">
      <li>Localized Pressures :Les pressions localis&eacute;es sont repr&eacute;sent&eacute;es soit par une &eacute;tiquette&nbsp;reprenant les valeurs des pressions, soit sans &eacute;tiquette. Par d&eacute;faut, elles sont dessin&eacute;es en&nbsp;brun sans &eacute;tiquette.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img src="images/fig13.png"></p>

    <ul class="noindent">
      <li>Boundary Conditions :Les conditions de bord apparraissent dans une &eacute;tiquette&nbsp; soit en toutes lettres, soit en symbole. Par d&eacute;faut, les conditions d'appui sont repr&eacute;sent&eacute;es par leurs symboles.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig14.png"></p>

    <ul class="noindent">
      <li>Grid :Une grille peut appara&icirc;tre dans la fen&ecirc;tre principale. Par d&eacute;faut, cette grille n'appara&icirc;t pas.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig15.png"></p>

    <ul class="noindent">
      <li>Flow Fleshes : Des fl&egrave;ches montrent le sens de parcours des panneaux. Par d&eacute;faut, elles sont affich&eacute;es en vert.</li>
    </ul>

    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <img src="images/fig16.png"></p>


<p>
</body>
</html>